package org.openscada.opc.lib.da;

/**
 * 实现该接口的类，将获取应用配置信息实例
 *
 * @author allen
 * @version : AppConfigurationAware.java, v 0.1 2016年2月28日 上午4:48:23 allen Exp $
 */
public class Test2 {

    public static void main(String[] args) {
        String str = "排气压力_空压机5-1-1,排气压力_空压机6-1-1,总管压力_空压机5-1-1,总管压力_空压机6-1-1,累积流量FT1-3-3,总管压力1-1-1,电机非驱动端轴承温度_空压机1-1-6,油箱温度_空压机1-1-6,总管温度1-1-6,冷却水进水压力_空压机1-1-1,冷却水出水压力_空压机1-1-1,主机压力_空压机2-1-1,主机压力_空压机3-1-1,主机压力_空压机4-1-1,主机压力_空压机5-1-1,主机压力_空压机6-1-1,主机压力_空压机7-1-1,主机压力_空压机8-1-1,排气压力_空压机7-1-1,排气压力_空压机1-1-1,电机驱动端轴承温度_空压机1-1-6,主机压力_空压机9-1-1,累积流量FT2-3-3,左塔压力PA_干燥机1-1-1,总管压力_空压机7-1-1,总管压力_空压机2-1-1,总管压力_空压机3-1-1,总管压力_空压机4-1-1,系统压力_空压机1-1-1,最终段进气温度_空压机1-1-6,目标压力_空压机1-1-1,排气压力_空压机2-1-1,排气压力_空压机4-1-1,电动机R相线圈温度_空压机1-1-6,瞬间流量FT1-1-3,瞬间流量FT2-1-3,右塔压力PB_干燥机1-1-1,冷却器出口温度T2_干燥机1-1-6,进口温度T1_干燥机1-1-6,加载压力_空压机1-1-1,露点_干燥机1-1-5,主机温度_空压机2-1-6,主机温度_空压机3-1-6,主机温度_空压机4-1-6,主机温度_空压机5-1-6,主机温度_空压机6-1-6,主机温度_空压机7-1-6,排气压力_空压机3-1-1,上限压力_系统1-1-1,下限压力_系统1-1-1,最小压力_系统1-1-1,加载压力_空压机2-1-1,加载压力_空压机3-1-1,加载压力_空压机4-1-1,加载压力_空压机5-1-1,加载压力_空压机6-1-1,加载压力_空压机7-1-1,加载压力_空压机8-1-1,加载压力_空压机9-1-1,累积流量FT3-3-1,累积流量FT4-3-1,累积流量FT5-3-1,累积流量FT6-3-1,累积流量FT7-3-1,主机温度_空压机8-1-6,主机温度_空压机9-1-6,排气压力_空压机8-1-1,排气压力_空压机9-1-1,瞬间流量FT3-1-2,瞬间流量FT4-1-2,瞬间流量FT5-1-2,瞬间流量FT6-1-2,瞬间流量FT7-1-2,总管压力_空压机8-1-1,总管压力_空压机9-1-1,油温_空压机1-1-6,冷却器进口温度T3_干燥机1-1-6";
        String [] arg = str.split(",");
        for(String prefix : arg){
            System.out.print("BY_KYZ.G1." + prefix+",");
        }
    }
}
