package org.openscada.opc.lib.da;

/**
 * 实现该接口的类，将获取应用配置信息实例
 *
 * @author allen
 * @version : AppConfigurationAware.java+ v 0.1 2016年2月28日 上午4:48:23 allen Exp $
 */
public class Test {
    public static void main(String[] args) {
        String str = "运行小时_空压机2-1             , "   +
                "电机电流_空压机8-1             , "   +
                "加载小时_空压机5-1             , "   +
                "运行小时_空压机4-1             , "   +
                "排气压力_空压机5-1             , "   +
                "排气压力_空压机6-1             , "   +
                "总管压力_空压机5-1             , "   +
                "总管压力_空压机6-1             , "   +
                "加载小时_空压机6-1             , "   +
                "卸载压力_空压机3-1             , "   +
                "电机电流_空压机9-1             , "   +
                "累积流量FT1-3                  , "   +
                "总管压力1-1                    , "   +
                "BOV_空压机1-1                  , "   +
                "IGV_空压机1-1                  , "   +
                "电机电流_空压机7-1             , "   +
                "加载小时_空压机4-1             , "   +
                "电机非驱动端轴承温度_空压机1-1 , "   +
                "三段振动_空压机1-1             , "   +
                "电机电流_空压机1-1             , "   +
                "油箱温度_空压机1-1             , "   +
                "总管温度1-1                    , "   +
                "卸载压力_空压机4-1             , "   +
                "冷却水进水压力_空压机1-1       , "   +
                "冷却水出水压力_空压机1-1       , "   +
                "主机压力_空压机2-1             , "   +
                "主机压力_空压机3-1             , "   +
                "主机压力_空压机4-1             , "   +
                "主机压力_空压机5-1             , "   +
                "主机压力_空压机6-1             , "   +
                "主机压力_空压机7-1             , "   +
                "主机压力_空压机8-1             , "   +
                "排气压力_空压机7-1             , "   +
                "排气压力_空压机1-1             , "   +
                "电机驱动端轴承温度_空压机1-1   , "   +
                "主机压力_空压机9-1             , "   +
                "SwapL_F1-4                     , "   +
                "SwapF_F1-4                     , "   +
                "累积流量FT2-3                  , "   +
                "左塔压力PA_干燥机1-1           , "   +
                "总管压力_空压机7-1             , "   +
                "总管压力_空压机2-1             , "   +
                "总管压力_空压机3-1             , "   +
                "总管压力_空压机4-1             , "   +
                "二段振动_空压机1-1             , "   +
                "系统压力_空压机1-1             , "   +
                "最终段进气温度_空压机1-1       , "   +
                "卸载压力_空压机7-1             , "   +
                "目标压力_空压机1-1             , "   +
                "排气压力_空压机2-1             , "   +
                "排气压力_空压机4-1             , "   +
                "电动机R相线圈温度_空压机1-1    , "   +
                "瞬间流量FT1-1                  , "   +
                "瞬间流量FT2-1                  , "   +
                "电机电流_空压机2-1             , "   +
                "电机电流_空压机3-1             , "   +
                "电机电流_空压机4-1             , "   +
                "电机电流_空压机5-1             , "   +
                "电机电流_空压机6-1             , "   +
                "一段振动_空压机1-1             , "   +
                "右塔压力PB_干燥机1-1           , "   +
                "加载小时_空压机1-1             , "   +
                "加载小时_空压机2-1             , "   +
                "冷却器出口温度T2_干燥机1-1     , "   +
                "进口温度T1_干燥机1-1           , "   +
                "运行小时_空压机1-1             , "   +
                "卸载压力_空压机5-1             , "   +
                "卸载压力_空压机6-1             , "   +
                "加载压力_空压机1-1             , "   +
                "卸载压力_空压机2-1             , "   +
                "卸载压力_空压机1-1             , "   +
                "露点_干燥机1-1                 , "   +
                "加载小时_空压机7-1             , "   +
                "运行小时_空压机7-1             , "   +
                "主机温度_空压机2-1             , "   +
                "主机温度_空压机3-1             , "   +
                "主机温度_空压机4-1             , "   +
                "主机温度_空压机5-1             , "   +
                "主机温度_空压机6-1             , "   +
                "主机温度_空压机7-1             , "   +
                "运行小时_空压机5-1             , "   +
                "运行小时_空压机6-1             , "   +
                "阀门状态_干燥机1-2             , "   +
                "运行小时_空压机3-1             , "   +
                "加载小时_空压机3-1             , "   +
                "排气压力_空压机3-1             , "   +
                "主备机数_空压机1-2             , "   +
                "主备机数_空压机2-2             , "   +
                "主备机数_空压机3-2             , "   +
                "主备机数_空压机4-2             , "   +
                "主备机数_空压机5-2             , "   +
                "主备机数_空压机6-2             , "   +
                "主备机数_空压机7-2             , "   +
                "主备机数_空压机8-2             , "   +
                "主备机数_空压机9-2             , "   +
                "主备机数_干燥机1-2             , "   +
                "主备机数_干燥机2-2             , "   +
                "主备机数_干燥机3-2             , "   +
                "主备机数_干燥机4-2             , "   +
                "主备机数_干燥机5-2             , "   +
                "主备机数_干燥机6-2             , "   +
                "主备机数_干燥机7-2             , "   +
                "主备机数_干燥机8-2             , "   +
                "主备机数_干燥机9-2             , "   +
                "上限压力_系统1-1               , "   +
                "下限压力_系统1-1               , "   +
                "最小压力_系统1-1               , "   +
                "加载延迟时间_系统1-2           , "   +
                "卸载延迟时间_系统1-2           , "   +
                "次序切换时间_系统1-2           , "   +
                "次序切换剩余时间_系统1-2       , "   +
                "空压机数量_系统1-2             , "   +
                "最少运行数量_系统1-2           , "   +
                "加载小时_空压机8-1             , "   +
                "加载小时_空压机9-1             , "   +
                "加载压力_空压机2-1             , "   +
                "加载压力_空压机3-1             , "   +
                "加载压力_空压机4-1             , "   +
                "加载压力_空压机5-1             , "   +
                "加载压力_空压机6-1             , "   +
                "加载压力_空压机7-1             , "   +
                "加载压力_空压机8-1             , "   +
                "加载压力_空压机9-1             , "   +
                "累积流量FT3-3                  , "   +
                "累积流量FT4-3                  , "   +
                "累积流量FT5-3                  , "   +
                "累积流量FT6-3                  , "   +
                "累积流量FT7-3                  , "   +
                "主机温度_空压机8-1             , "   +
                "主机温度_空压机9-1             , "   +
                "排气压力_空压机8-1             , "   +
                "排气压力_空压机9-1             , "   +
                "瞬间流量FT3-1                  , "   +
                "瞬间流量FT4-1                  , "   +
                "瞬间流量FT5-1                  , "   +
                "瞬间流量FT6-1                  , "   +
                "瞬间流量FT7-1                  , "   +
                "油压_空压机1-1                 , "   +
                "卸载压力_空压机8-1             , "   +
                "卸载压力_空压机9-1             , "   +
                "总管压力_空压机8-1             , "   +
                "总管压力_空压机9-1             , "   +
                "油温_空压机1-1                 , "   +
                "运行小时_空压机8-1             , "   +
                "运行小时_空压机9-1             , "   +
                "冷却器进口温度T3_干燥机1-1     , ";

        String [] a = str.split(",");
        for(String b : a){
            System.out.print(b.trim() + ",");
        }

    }

}
